In [1]:
import pandas as pd
import numpy as np

Data set de juguete: incendios en amazonas brasileño

In [5]:
data = pd.read_csv(r'C:\Users\pepaq\Documents\Data Science\Escuela casera de datos\amazon.csv', sep=',', encoding='latin_1')

### Yuri Carvajal’s check list

What’s dataset source?

What’s dataset date/time?

How many records has?

How many pure duplicates contains?

What type is each column?

https://www.kaggle.com/gustavomodelli/forest-fires-in-brazil

In [12]:
data.head()

   year state    month  number        date
0  1998  Acre  Janeiro     0.0  1998-01-01
1  1999  Acre  Janeiro     0.0  1999-01-01
2  2000  Acre  Janeiro     0.0  2000-01-01
3  2001  Acre  Janeiro     0.0  2001-01-01
4  2002  Acre  Janeiro     0.0  2002-01-01

In [10]:
data.dtypes

year        int64
state      object
month      object
number    float64
date       object
dtype: object

In [11]:
data.shape

(6454, 5)

In [9]:
data.describe()

              year       number
count  6454.000000  6454.000000
mean   2007.461729   108.293163
std       5.746654   190.812242
min    1998.000000     0.000000
25%    2002.000000     3.000000
50%    2007.000000    24.000000
75%    2012.000000   113.000000
max    2017.000000   998.000000

In [6]:
data.head()

   year state    month  number        date
0  1998  Acre  Janeiro     0.0  1998-01-01
1  1999  Acre  Janeiro     0.0  1999-01-01
2  2000  Acre  Janeiro     0.0  2000-01-01
3  2001  Acre  Janeiro     0.0  2001-01-01
4  2002  Acre  Janeiro     0.0  2002-01-01